var rule = {
    title:'咖啡影视',
    host:'https://cfys.xyz/',
    hostJs:'let url=HOST;let html= request(url);let src=jsp.pdfh(html,".btn-down:eq(0)&&href");HOST=src',
    homeUrl:'/vodshow/21--------1---.html',
    searchUrl:'/vodsearch/**----------fypage---.html',
    url:'/vodshow/fyclassfyfilter.html',
    filter_url:'-{{fl.dq}}--{{fl.jq}}-{{fl.lg}}----fypage---{{fl.year}}',
    filter:{
        "21":[{"key":"jq","name":"剧情","value":[{"n": "全部","v": "" },{"n": "古装","v": "古装" },{"v":"战争","n":"战争"},{"v":"青春偶像","n":"青春偶像"},{"v":"喜剧","n":"喜剧"},{"v":"家庭","n":"家庭"},{"v":"犯罪","n":"犯罪"},{"v":"动作","n":"动作"},{"v":"奇幻","n":"奇幻"},{"v":"剧情","n":"剧情"},{"v":"历史","n":"历史"},{"v":"经典","n":"经典"},{"v":"乡村","n":"乡村"},{"v":"情景","n":"情景"},{"v":"商战","n":"商战"},{"v":"网剧","n":"网剧"},{"v":"其他","n":"其他"}]},{"key":"dq","name":"地区","value":[{"n": "全部","v": ""},{"n": "内地","v": "内地"},{"n":"大陆","v":"大陆"},{"n":"美国","v":"美国"},{"n":"韩国","v":"韩国"},{"n":"日本","v":"日本"},{"n":"泰国","v":"泰国"},{"n":"英国","v":"英国"},{"n":"新加坡","v":"新加坡"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"}]},{"key":"lg","name":"语言","value":[{"n": "全部","v": ""},{"n": "国语","v": "国语"},{"n":"英语","v":"英语"},{"n":"粤语","v":"粤语"},{"n":"闽南语","v":"闽南语"},{"n":"韩语","v":"韩语"},{"n":"日语","v":"日语"},{"n":"其它","v":"其它"}]}],
        "23":[{"key":"jq","name":"剧情","value":[{"n": "全部","v": "" },{"n":"情感","v":"情感"},{"n":"科幻","v":"科幻"},{"n":"热血","v":"热血"},{"n":"推理","v":"推理"},{"n":"搞笑","v":"搞笑"},{"n":"冒险","v":"冒险"},{"n":"萝莉","v":"萝莉"},{"n":"校园","v":"校园"},{"n":"动作","v":"动作"},{"n":"机战","v":"机战"},{"n":"运动","v":"运动"},{"n":"战争","v":"战争"},{"n":"少年","v":"少年"},{"n":"少女","v":"少女"},{"n":"社会","v":"社会"},{"n":"原创","v":"原创"},{"n":"亲子","v":"亲子"},{"n":"益智","v":"益智"},{"n":"励志","v":"励志"},{"n":"其他","v":"其他"}]},{"key":"dq","name":"地区","value":[{"n": "全部","v": ""},{"n":"国产","v":"国产"},{"n":"日本","v":"日本"},{"n":"欧美","v":"欧美"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"}]},{"key":"lg","name":"语言","value":[{"n": "全部","v": ""},{"n":"国语","v":"国语"},{"n":"英语","v":"英语"},{"n":"粤语","v":"粤语"},{"n":"闽南语","v":"闽南语"},{"n":"韩语","v":"韩语"},{"n":"日语","v":"日语"},{"n":"其它","v":"其它"}]}],
        "20":[{"key":"jq","name":"剧情","value":[{"n": "全部","v": "" },{"n":"恐怖","v":"恐怖"},{"n":"动作","v":"动作"},{"n":"科幻","v":"科幻"},{"n":"剧情","v":"剧情"},{"n":"战争","v":"战争"},{"n":"警匪","v":"警匪"},{"n":"犯罪","v":"犯罪"},{"n":"喜剧","v":"喜剧"},{"n":"爱情","v":"爱情"},{"n":"动画","v":"动画"},{"n":"奇幻","v":"奇幻"},{"n":"武侠","v":"武侠"},{"n":"冒险","v":"冒险"},{"n":"枪战","v":"枪战"},{"n":"恐怖","v":"恐怖"},{"n":"悬疑","v":"悬疑"},{"n":"惊悚","v":"惊悚"},{"n":"经典","v":"经典"},{"n":"青春","v":"青春"},{"n":"文艺","v":"文艺"},{"n":"微电影","v":"微电影"},{"n":"古装","v":"古装"},{"n":"历史","v":"历史"},{"n":"运动","v":"运动"},{"n":"农村","v":"农村"},{"n":"儿童","v":"儿童"},{"n":"网络电影","v":"网络电影"}]},{"key":"dq","name":"地区","value":[{"n": "全部","v": ""},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"美国","v":"美国"},{"n":"法国","v":"法国"},{"n":"英国","v":"英国"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},{"n":"印度","v":"印度"},{"n":"意大利","v":"意大利"},{"n":"西班牙","v":"西班牙"},{"n":"加拿大","v":"加拿大"},{"n":"其他","v":"其他"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"}]},{"key":"lg","name":"语言","value":[{"n": "全部","v": ""},{"n":"国语","v":"国语"},{"n":"英语","v":"英语"},{"n":"粤语","v":"粤语"},{"n":"闽南语","v":"闽南语"},{"n":"韩语","v":"韩语"},{"n":"日语","v":"日语"},{"n":"法语","v":"法语"},{"n":"德语","v":"德语"},{"n":"其它","v":"其它"}]}],
        "22":[{"key":"jq","name":"剧情","value":[{"n": "全部","v": "" },{"n":"选秀","v":"选秀"},{"n":"情感","v":"情感"},{"n":"访谈","v":"访谈"},{"n":"播报","v":"播报"},{"n":"旅游","v":"旅游"},{"n":"音乐","v":"音乐"},{"n":"美食","v":"美食"},{"n":"纪实","v":"纪实"},{"n":"曲艺","v":"曲艺"},{"n":"生活","v":"生活"},{"n":"游戏互动","v":"游戏互动"},{"n":"财经","v":"财经"},{"n":"求职","v":"求职"}]},{"key":"dq","name":"地区","value":[{"n": "全部","v": ""},{"n":"内地","v":"内地"},{"n":"港台","v":"港台"},{"n":"日韩","v":"日韩"},{"n":"欧美","v":"欧美"}]},{"key":"year","name":"年份","value":[{"n":"全部","v":""},{"n":"2024","v":"2024"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"}]},{"key":"lg","name":"语言","value":[{"n": "全部","v": ""},{"n":"国语","v":"国语"},{"n":"英语","v":"英语"},{"n":"粤语","v":"粤语"},{"n":"闽南语","v":"闽南语"},{"n":"韩语","v":"韩语"},{"n":"日语","v":"日语"},{"n":"其它","v":"其它"}]}]
    },    
    headers:{"User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/122.0.0.0 Safari/537.36 Edg/122.0.0.0"},
    timeout:5000,
    class_name:'追剧&动漫&电影&综艺',
    class_url:'21&23&20&22',
    limit:5,
    multi:1,
    searchable:1,
    play_parse:true,
    lazy:`js:
        let html=request(input);
        let url=JSON.parse(html.match(/r player_.*?=(.*?)</)[1]).url;
        if (/m3u8|mp4|mp3|flv/.test(url)) {
            input = {
                jx: 0,
                url: url,
                parse: 0
            }
        } else {
            input=input
        }
    `,
    推荐:`js:
        let html=request(input);
        let list = jsp.pdfa(html, '.module-poster-item.module-item');

        let d = [];
        list.forEach(it => {
            d.push({
                url:jsp.pd(it,'a&&href'),
                title: jsp.pdfh(it, 'a&&title'),
                img:jsp.pdfh(it,'img&&data-original')
            })
        });
        setResult(d);
    `,
    一级:`js:
        let html=request(input);
        let list = jsp.pdfa(html, '.module-items&&a');

        let d = [];
        list.forEach(it => {
            d.push({
                url:jsp.pd(it,'a&&href'),
                title: jsp.pdfh(it, 'a&&title'),
                img:jsp.pdfh(it,'img&&data-original')
            })
        });
        setResult(d);
    `,
    二级:`js:
            let html=request(input);
            let list1=jsp.pdfa(html,'#y-playList&&span');
            let list2=jsp.pdfa(html,'.module-play-list-content');;
            let pf=[];
            let pu=[];
            list1.forEach(a=>{pf.push(jsp.pdfh(a,'span&&Text'))});
            list2.map(a=>{let ulist=jsp.pdfa(a,'a');let str=[];ulist.map(b=>{str.push(jsp.pdfh(b,'span&&Text')+'$'+jsp.pd(b,'a&&href'))});pu.push(str.join('#'));
        })
            let vod={
            vod_id:'',
            vod_name:jsp.pdfh(html,'h1&&Text'),
            vod_pic:jsp.pdfh(html,'.ls-is-cached&&data-original'),
            type_name:'来自海阔',
            vod_content:jsp.pdfh(html,'.module-info-introduction-content&&Text')
        };
        vod.vod_play_from =pf.join('$$$');
        vod.vod_play_url = pu.join('$$$');
        VOD=vod`,
    搜索:`js:
        let html=request(input);
        let list = jsp.pdfa(html, '.module-card-item.module-item');

        let d = [];
        list.forEach(it => {
            d.push({
                url:jsp.pd(it,'.module-card-item-title&&a&&href'),
                title: jsp.pdfh(it,'.module-card-item-title&&a&&strong&&Text'),
                img:jsp.pdfh(it,'img&&data-original')
            })
        });
        setResult(d);
    `,
}